; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-6-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	s14 - location
	p0-2 - location
	p0-6 - location
	p1-4 - location
	p2-4 - location
	p2-5 - location
	p2-8 - location
	p2-10 - location
	p2-14 - location
	p3-7 - location
	p5-0 - location
	p5-3 - location
	p6-3 - location
	p6-7 - location
	p6-9 - location
	p7-0 - location
	p7-1 - location
	p7-11 - location
	p7-14 - location
	p8-13 - location
	p9-12 - location
	p10-6 - location
	p11-3 - location
	p11-4 - location
	p11-9 - location
	p12-10 - location
	p13-8 - location
	p14-12 - location
	)
	(:init
	(at driver1 s14)
	(at driver2 s12)
	(at driver3 s4)
	(at truck1 s8)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s8)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s13)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s7)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s14)
	(at package2 s3)
	(at package3 s12)
	(at package4 s12)
	(at package5 s14)
	(at package6 s12)
	(at package7 s4)
	(at package8 s4)
	(at package9 s6)
	(at package10 s0)
	(at package11 s3)
	(at package12 s13)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(path s2 p2-14)
	(path p2-14 s2)
	(path s14 p2-14)
	(path p2-14 s14)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s7 p7-14)
	(path p7-14 s7)
	(path s14 p7-14)
	(path p7-14 s14)
	(path s8 p8-13)
	(path p8-13 s8)
	(path s13 p8-13)
	(path p8-13 s13)
	(path s9 p9-12)
	(path p9-12 s9)
	(path s12 p9-12)
	(path p9-12 s12)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(path s11 p11-3)
	(path p11-3 s11)
	(path s3 p11-3)
	(path p11-3 s3)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(path s11 p11-9)
	(path p11-9 s11)
	(path s9 p11-9)
	(path p11-9 s9)
	(path s12 p12-10)
	(path p12-10 s12)
	(path s10 p12-10)
	(path p12-10 s10)
	(path s14 p14-12)
	(path p14-12 s14)
	(path s12 p14-12)
	(path p14-12 s12)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 92)
	(= (time-to-drive s7 s0) 92)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 61)
	(= (time-to-drive s8 s0) 61)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 79)
	(= (time-to-drive s12 s0) 79)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 96)
	(= (time-to-drive s2 s1) 96)
	(link s1 s11)
	(link s11 s1)
	(= (time-to-drive s1 s11) 29)
	(= (time-to-drive s11 s1) 29)
	(link s1 s13)
	(link s13 s1)
	(= (time-to-drive s1 s13) 78)
	(= (time-to-drive s13 s1) 78)
	(link s1 s14)
	(link s14 s1)
	(= (time-to-drive s1 s14) 85)
	(= (time-to-drive s14 s1) 85)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 89)
	(= (time-to-drive s3 s2) 89)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 65)
	(= (time-to-drive s6 s3) 65)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 19)
	(= (time-to-drive s3 s4) 19)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 86)
	(= (time-to-drive s5 s4) 86)
	(link s5 s12)
	(link s12 s5)
	(= (time-to-drive s5 s12) 22)
	(= (time-to-drive s12 s5) 22)
	(link s5 s14)
	(link s14 s5)
	(= (time-to-drive s5 s14) 40)
	(= (time-to-drive s14 s5) 40)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 17)
	(= (time-to-drive s1 s6) 17)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 35)
	(= (time-to-drive s4 s6) 35)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 21)
	(= (time-to-drive s2 s7) 21)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 81)
	(= (time-to-drive s3 s7) 81)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 99)
	(= (time-to-drive s6 s8) 99)
	(link s8 s12)
	(link s12 s8)
	(= (time-to-drive s8 s12) 94)
	(= (time-to-drive s12 s8) 94)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 13)
	(= (time-to-drive s1 s9) 13)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 1)
	(= (time-to-drive s2 s9) 1)
	(link s9 s12)
	(link s12 s9)
	(= (time-to-drive s9 s12) 13)
	(= (time-to-drive s12 s9) 13)
	(link s9 s14)
	(link s14 s9)
	(= (time-to-drive s9 s14) 36)
	(= (time-to-drive s14 s9) 36)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 73)
	(= (time-to-drive s8 s10) 73)
	(link s10 s13)
	(link s13 s10)
	(= (time-to-drive s10 s13) 51)
	(= (time-to-drive s13 s10) 51)
	(link s10 s14)
	(link s14 s10)
	(= (time-to-drive s10 s14) 20)
	(= (time-to-drive s14 s10) 20)
	(link s11 s0)
	(link s0 s11)
	(= (time-to-drive s11 s0) 47)
	(= (time-to-drive s0 s11) 47)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 33)
	(= (time-to-drive s3 s11) 33)
	(link s11 s4)
	(link s4 s11)
	(= (time-to-drive s11 s4) 34)
	(= (time-to-drive s4 s11) 34)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 61)
	(= (time-to-drive s7 s11) 61)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 79)
	(= (time-to-drive s9 s11) 79)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 25)
	(= (time-to-drive s10 s11) 25)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 21)
	(= (time-to-drive s2 s12) 21)
	(link s12 s6)
	(link s6 s12)
	(= (time-to-drive s12 s6) 58)
	(= (time-to-drive s6 s12) 58)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 21)
	(= (time-to-drive s10 s12) 21)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 50)
	(= (time-to-drive s11 s12) 50)
	(link s13 s0)
	(link s0 s13)
	(= (time-to-drive s13 s0) 35)
	(= (time-to-drive s0 s13) 35)
	(link s13 s3)
	(link s3 s13)
	(= (time-to-drive s13 s3) 6)
	(= (time-to-drive s3 s13) 6)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 39)
	(= (time-to-drive s7 s13) 39)
	(link s13 s8)
	(link s8 s13)
	(= (time-to-drive s13 s8) 99)
	(= (time-to-drive s8 s13) 99)
	(link s13 s9)
	(link s9 s13)
	(= (time-to-drive s13 s9) 25)
	(= (time-to-drive s9 s13) 25)
	(link s13 s12)
	(link s12 s13)
	(= (time-to-drive s13 s12) 24)
	(= (time-to-drive s12 s13) 24)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s11)
	(at truck1 s5)
	(at truck2 s13)
	(at truck3 s7)
	(at truck5 s11)
	(at package1 s8)
	(at package2 s8)
	(at package3 s6)
	(at package5 s4)
	(at package6 s8)
	(at package7 s10)
	(at package8 s4)
	(at package9 s2)
	(at package10 s10)
	(at package11 s9)
	(at package12 s13)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver3 s4 p2-4)
   deleted: (at driver3 s4)
   added: (at driver3 p2-4)
   goals met: 2 of 16
2. (walk driver1 s14 p7-14)
   deleted: (at driver1 s14)
   added: (at driver1 p7-14)
   goals met: 2 of 16
3. (walk driver3 p2-4 s2)
   deleted: (at driver3 p2-4)
   added: (at driver3 s2)
   goals met: 2 of 16
4. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 2 of 16
5. (walk driver1 p7-14 s7)
   deleted: (at driver1 p7-14)
   added: (at driver1 s7)
   goals met: 2 of 16
6. (walk driver1 s7 p7-11)
   deleted: (at driver1 s7)
   added: (at driver1 p7-11)
   goals met: 2 of 16
7. (drive-truck truck3 s2 s7 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s7)
   changed: (fuel-used) from 0 to 210
   goals met: 3 of 16
8. (drive-truck truck3 s7 s13 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s13)
   changed: (fuel-used) from 210 to 600
   goals met: 2 of 16
9. (walk driver1 p7-11 s11)
   deleted: (at driver1 p7-11)
   added: (at driver1 s11)
   goals met: 3 of 16
10. (drive-truck truck3 s13 s8 driver3)
   deleted: (at truck3 s13)
   added: (at truck3 s8)
   changed: (fuel-used) from 600 to 1590
   goals met: 3 of 16
11. (walk driver1 s11 p11-3)
   deleted: (at driver1 s11)
   added: (at driver1 p11-3)
   goals met: 2 of 16
12. (walk driver1 p11-3 s3)
   deleted: (at driver1 p11-3)
   added: (at driver1 s3)
   goals met: 2 of 16
13. (drive-truck truck3 s8 s6 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (fuel-used) from 1590 to 2580
   goals met: 2 of 16
14. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 16
15. (drive-truck truck3 s6 s1 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (fuel-used) from 2580 to 2750
   goals met: 2 of 16
16. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 16
17. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 16
18. (drive-truck truck2 s3 s4 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (fuel-used) from 2750 to 2997
   goals met: 2 of 16
19. (drive-truck truck3 s1 s13 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s13)
   changed: (fuel-used) from 2997 to 3777
   goals met: 2 of 16
20. (load-truck package7 truck2 s4)
   deleted: (at package7 s4)
   added: (in package7 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 16
21. (drive-truck truck2 s4 s11 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s11)
   changed: (fuel-used) from 3777 to 4321
   goals met: 2 of 16
22. (disembark-truck driver3 truck3 s13)
   deleted: (driving driver3 truck3)
   added: (at driver3 s13) (empty truck3)
   goals met: 2 of 16
23. (drive-truck truck2 s11 s9 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s9)
   changed: (fuel-used) from 4321 to 5585
   goals met: 2 of 16
24. (unload-truck package11 truck2 s9)
   deleted: (in package11 truck2)
   added: (at package11 s9)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 3 of 16
25. (drive-truck truck2 s9 s13 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s13)
   changed: (fuel-used) from 5585 to 5910
   goals met: 4 of 16
26. (drive-truck truck2 s13 s8 driver1)
   deleted: (at truck2 s13)
   added: (at truck2 s8)
   changed: (fuel-used) from 5910 to 7197
   goals met: 3 of 16
27. (unload-truck package2 truck2 s8)
   deleted: (in package2 truck2)
   added: (at package2 s8)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 4 of 16
28. (walk driver3 s13 p8-13)
   deleted: (at driver3 s13)
   added: (at driver3 p8-13)
   goals met: 4 of 16
29. (drive-truck truck2 s8 s10 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s10)
   changed: (fuel-used) from 7197 to 8000
   goals met: 4 of 16
30. (unload-truck package7 truck2 s10)
   deleted: (in package7 truck2)
   added: (at package7 s10)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 16
31. (drive-truck truck2 s10 s14 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s14)
   changed: (fuel-used) from 8000 to 8200
   goals met: 5 of 16
32. (load-truck package1 truck2 s14)
   deleted: (at package1 s14)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 16
33. (drive-truck truck2 s14 s10 driver1)
   deleted: (at truck2 s14)
   added: (at truck2 s10)
   changed: (fuel-used) from 8200 to 8420
   goals met: 5 of 16
34. (drive-truck truck2 s10 s8 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s8)
   changed: (fuel-used) from 8420 to 9223
   goals met: 5 of 16
35. (unload-truck package1 truck2 s8)
   deleted: (in package1 truck2)
   added: (at package1 s8)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 16
36. (drive-truck truck2 s8 s13 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s13)
   changed: (fuel-used) from 9223 to 10213
   goals met: 7 of 16
37. (walk driver3 p8-13 s8)
   deleted: (at driver3 p8-13)
   added: (at driver3 s8)
   goals met: 7 of 16
38. (board-truck driver3 truck1 s8)
   deleted: (at driver3 s8) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 16
39. (disembark-truck driver1 truck2 s13)
   deleted: (driving driver1 truck2)
   added: (at driver1 s13) (empty truck2)
   goals met: 7 of 16
40. (drive-truck truck1 s8 s12 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s12)
   changed: (fuel-used) from 10213 to 11153
   goals met: 7 of 16
41. (board-truck driver1 truck5 s13)
   deleted: (at driver1 s13) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 7 of 16
42. (drive-truck truck5 s13 s7 driver1)
   deleted: (at truck5 s13)
   added: (at truck5 s7)
   changed: (fuel-used) from 11153 to 11543
   goals met: 7 of 16
43. (load-truck package3 truck1 s12)
   deleted: (at package3 s12)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 16
44. (load-truck package6 truck1 s12)
   deleted: (at package6 s12)
   added: (in package6 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 7 of 16
45. (drive-truck truck5 s7 s11 driver1)
   deleted: (at truck5 s7)
   added: (at truck5 s11)
   changed: (fuel-used) from 11543 to 12153
   goals met: 8 of 16
46. (disembark-truck driver1 truck5 s11)
   deleted: (driving driver1 truck5)
   added: (at driver1 s11) (empty truck5)
   goals met: 9 of 16
47. (drive-truck truck1 s12 s8 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s8)
   changed: (fuel-used) from 12153 to 13375
   goals met: 9 of 16
48. (unload-truck package6 truck1 s8)
   deleted: (in package6 truck1)
   added: (at package6 s8)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 10 of 16
49. (drive-truck truck1 s8 s0 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (fuel-used) from 13375 to 14046
   goals met: 10 of 16
50. (load-truck package10 truck1 s0)
   deleted: (at package10 s0)
   added: (in package10 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 10 of 16
51. (drive-truck truck1 s0 s12 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s12)
   changed: (fuel-used) from 14046 to 15073
   goals met: 10 of 16
52. (drive-truck truck1 s12 s5 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s5)
   changed: (fuel-used) from 15073 to 15359
   goals met: 11 of 16
53. (drive-truck truck1 s5 s14 driver3)
   deleted: (at truck1 s5)
   added: (at truck1 s14)
   changed: (fuel-used) from 15359 to 15879
   goals met: 10 of 16
54. (load-truck package5 truck1 s14)
   deleted: (at package5 s14)
   added: (in package5 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 10 of 16
55. (drive-truck truck1 s14 s10 driver3)
   deleted: (at truck1 s14)
   added: (at truck1 s10)
   changed: (fuel-used) from 15879 to 16199
   goals met: 10 of 16
56. (unload-truck package10 truck1 s10)
   deleted: (in package10 truck1)
   added: (at package10 s10)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 11 of 16
57. (drive-truck truck1 s10 s12 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s12)
   changed: (fuel-used) from 16199 to 16472
   goals met: 11 of 16
58. (drive-truck truck1 s12 s6 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s6)
   changed: (fuel-used) from 16472 to 17226
   goals met: 11 of 16
59. (load-truck package9 truck1 s6)
   deleted: (at package9 s6)
   added: (in package9 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 11 of 16
60. (drive-truck truck1 s6 s4 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (fuel-used) from 17226 to 17786
   goals met: 11 of 16
61. (unload-truck package5 truck1 s4)
   deleted: (in package5 truck1)
   added: (at package5 s4)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 12 of 16
62. (drive-truck truck1 s4 s6 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   changed: (fuel-used) from 17786 to 18241
   goals met: 12 of 16
63. (unload-truck package3 truck1 s6)
   deleted: (in package3 truck1)
   added: (at package3 s6)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 13 of 16
64. (drive-truck truck1 s6 s12 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s12)
   changed: (fuel-used) from 18241 to 18879
   goals met: 13 of 16
65. (drive-truck truck1 s12 s2 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s2)
   changed: (fuel-used) from 18879 to 19110
   goals met: 13 of 16
66. (unload-truck package9 truck1 s2)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 14 of 16
67. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 14 of 16
68. (walk driver2 s12 p9-12)
   deleted: (at driver2 s12)
   added: (at driver2 p9-12)
   goals met: 14 of 16
69. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 14 of 16
70. (drive-truck truck1 s2 s12 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s12)
   changed: (fuel-used) from 19110 to 19320
   goals met: 14 of 16
71. (drive-truck truck1 s12 s13 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s13)
   changed: (fuel-used) from 19320 to 19560
   goals met: 14 of 16
72. (disembark-truck driver3 truck1 s13)
   deleted: (driving driver3 truck1)
   added: (at driver3 s13) (empty truck1)
   goals met: 14 of 16
73. (board-truck driver3 truck3 s13)
   deleted: (at driver3 s13) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 14 of 16
74. (drive-truck truck3 s13 s7 driver3)
   deleted: (at truck3 s13)
   added: (at truck3 s7)
   changed: (fuel-used) from 19560 to 19950
   goals met: 15 of 16
75. (disembark-truck driver3 truck3 s7)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 15 of 16
76. (board-truck driver1 truck5 s11)
   deleted: (at driver1 s11) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 14 of 16
77. (drive-truck truck5 s11 s1 driver1)
   deleted: (at truck5 s11)
   added: (at truck5 s1)
   changed: (fuel-used) from 19950 to 20240
   goals met: 13 of 16
78. (board-truck driver3 truck6 s7)
   deleted: (at driver3 s7) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 13 of 16
79. (drive-truck truck5 s1 s11 driver1)
   deleted: (at truck5 s1)
   added: (at truck5 s11)
   changed: (fuel-used) from 20240 to 20530
   goals met: 14 of 16
80. (disembark-truck driver1 truck5 s11)
   deleted: (driving driver1 truck5)
   added: (at driver1 s11) (empty truck5)
   goals met: 15 of 16
81. (drive-truck truck6 s7 s13 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s13)
   changed: (fuel-used) from 20530 to 20920
   goals met: 15 of 16
82. (disembark-truck driver3 truck6 s13)
   deleted: (driving driver3 truck6)
   added: (at driver3 s13) (empty truck6)
   goals met: 15 of 16
83. (board-truck driver3 truck1 s13)
   deleted: (at driver3 s13) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 15 of 16
84. (drive-truck truck1 s13 s12 driver3)
   deleted: (at truck1 s13)
   added: (at truck1 s12)
   changed: (fuel-used) from 20920 to 21160
   goals met: 15 of 16
85. (drive-truck truck1 s12 s5 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s5)
   changed: (fuel-used) from 21160 to 21380
   goals met: 16 of 16
